using StaticArrays
p = 3

ϕ(u) = -0.5*log(u[1]^2 - u[2:3]'*u[2:3])
J = @SMatrix [1. 0. 0.;
              0. -1. 0.;
              0. 0. -1.]
∇ϕ(u) = -J*u./(u'*J*u)
∇²ϕ(u) = (2*J*u*u'*J - (u'*J*u)*J)./(u'*J*u)^2

u0 = [1.0e-8;0.;0.]
ϕ(u0)
∇ϕ(u0)
∇²ϕ(u0)

u1 = [1.0;0.;0.]
ϕ(u1)
∇ϕ(u1)
∇²ϕ(u1)

∇ψ(u,y) = (@SVector [-u[1], u[2], u[3]])*y
∇ψ(ones(p),1.0)

∇²ψ(u,y) = @SMatrix [
                     -y 0 0 -u[1];
                     0 y 0 u[2];
                     0 0 y u[3];
                     -u[1] u[2] u[3] 0.5
                     ]

∇²ψ(u1,1.0)

eigen(∇²ψ(u0,1.0e-8))
